en_to_ko_map = {
        r"Solutions?": "솔루션즈", r"Fintech": "핀테크", r"Labs?": "랩스",
        r"Systems?": "시스템즈", r"Networks?": "네트웍스", r"Softwares?": "소프트웨어",
        r"Technologies": "테크놀로지", r"Tech": "테크"
    }

typo_fix_map = {"팬다": "판다", "팬더": "판다","팽귄": "펭귄"}

conflict_groups = [
        {"si", "ai"}, {"이커머스", "커머스"}, {"테크", "핀테크"}, {'웹솔루션', '솔루션'},
        {"가젤", "가재"}, {"범고래", "고래", "돌고래", "고래웹", "고퍼"}, {"길고양이", "고양이"}, {"금고", "금융"},
        {"불곰", "곰"}, {"매화", "매소"}, {"용", "곰"}, {"가오리", "오리", "오픈"}, {'벚꽃', "봄꽃"},
        {"왕나비", "나비", "담비", "제비", "나무"}, {"낙타", "낙엽"}, {"수리", "오리", "오솔"}, {'문어', '베어', "문조"},
        {"살구", "덕구"}, {"레드판다", "레서판다"}, {"토끼", "멧토끼", "수토끼", "토끼몰"},
        {"솔개", "물개", "솔잎"}, {"문어", "복어"}, {"밍크", "오크"}, {'매화', '국화'}, {'맹수', '맹금'},
        {"백합", "백호", "백조", "문조", "타조"}, {"벌새", "참새", "잎새"}, {"별꽃", "벚꽃"},
        {"블랙팬더", "블랙팬서"}, {"사슴", "사자", "꽃사슴"}, {"서벌캣", "서핑캣"}, {'비호', "산호"},
        {"소나무", "소나기"}, {"알파벳", "알파바"}, {"오소리", "오리"}, {"울프", "리프"}, {'수리', "독수리", "수달"},
        {"전자연", "전자숲"}, {"코브라", "킹코브라", "코알라"}, {"파이톤", "파이참"}, {'파랑나비', '호랑나비'},
        {'파이낸셜', '파이낸스'},{'파이널', '파이어'},{"파파고", "파파야"}, {"파인튜닝", "파인튜너"}, {"하늘매", "하늘소"}, {'퓨마', '하마'},
        {"푸른별", "푸른솔", "푸른양", "푸른들", "푸른잎", "푸른눈", "푸른나무", "푸른앵무", "푸른소나무", "푸른용"},
        {"나무", "큰나무", "전나무", "팝나무", "대나무", "밤나무", "삼나무", "참나무", "감나무", "녹나무", "벚나무", "소나무"}
    ]

protected_keywords = {"랩", "웹"}